; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v13 ?v5)
             (pred_11 ?v9 ?v6)
             (pred_8 ?v13 ?v6)
             (pred_9 ?v12 ?v13 )
	     (pred_12 ?v13)
             (pred_1 ?v10)
             (pred_4 ?v9)
             (pred_6 ?v6)
             (pred_5 ?v13)
             (pred_2 ?v9)
             (pred_10 ?v13)
             (pred_7 ))



(:action op_2
:parameters (?v11 ?v1 ?v8 ?v3)
:precondition (and (pred_1 ?v11) (pred_1 ?v1) (pred_4 ?v8) (pred_6 ?v3)
          (pred_3 ?v11 ?v1) (pred_11 ?v8 ?v3)
                   (pred_8 ?v1 ?v3) (pred_12 ?v11) 
                   (pred_5 ?v1) (pred_2 ?v8))
:effect (and  (pred_10 ?v1) (not (pred_5 ?v1))))


(:action op_3
:parameters (?v11 ?v2)
:precondition (and (pred_1 ?v11) (pred_1 ?v2)
               (pred_12 ?v11) (pred_3 ?v11 ?v2) (pred_10 ?v2))
:effect (and (pred_12 ?v2) (not (pred_12 ?v11))))

(:action op_4
:parameters (?v11 ?v8)
:precondition (and (pred_1 ?v11) (pred_4 ?v8) 
                  (pred_12 ?v11) (pred_9 ?v8 ?v11) (pred_7 ))
:effect (and (pred_2 ?v8)
   (not (pred_9 ?v8 ?v11)) (not (pred_7 ))))


(:action op_1
:parameters (?v11 ?v7 ?v4)
:precondition (and (pred_1 ?v11) (pred_4 ?v7) (pred_4 ?v4)
                  (pred_12 ?v11) (pred_2 ?v4) (pred_9 ?v7 ?v11))
:effect (and (pred_2 ?v7) (pred_9 ?v4 ?v11)
        (not (pred_2 ?v4)) (not (pred_9 ?v7 ?v11))))

(:action op_5
:parameters (?v11 ?v8)
:precondition (and (pred_1 ?v11) (pred_4 ?v8) 
                  (pred_12 ?v11) (pred_2 ?v8))
:effect (and (pred_7 ) (pred_9 ?v8 ?v11) (not (pred_2 ?v8)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_05 obj_19 obj_11 obj_12 obj_10 obj_18 obj_16 obj_04 obj_08 obj_13 obj_15 obj_02 obj_14 obj_06 obj_17
    obj_01 obj_09
    obj_07 obj_03
    )

    (:init
       (pred_7)

       (pred_1 obj_20)
       (pred_1 obj_05)
       (pred_1 obj_19)
       (pred_1 obj_11)
       (pred_1 obj_12)
       (pred_1 obj_10)
       (pred_1 obj_18)
       (pred_1 obj_16)
       (pred_1 obj_04)
       (pred_1 obj_08)
       (pred_1 obj_13)
       (pred_1 obj_15)
       (pred_1 obj_02)
       (pred_1 obj_14)
       (pred_1 obj_06)
       (pred_1 obj_17)
       (pred_6 obj_01)
       (pred_6 obj_09)
       (pred_4 obj_07)
       (pred_4 obj_03)

       (pred_3 obj_20 obj_12)
       (pred_3 obj_20 obj_05)
       (pred_3 obj_05 obj_10)
       (pred_3 obj_05 obj_19)
       (pred_3 obj_05 obj_20)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_19 obj_11)
       (pred_3 obj_19 obj_05)
       (pred_3 obj_11 obj_16)
       (pred_3 obj_11 obj_19)
       (pred_3 obj_12 obj_04)
       (pred_3 obj_12 obj_10)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_10 obj_08)
       (pred_3 obj_10 obj_18)
       (pred_3 obj_10 obj_05)
       (pred_3 obj_10 obj_12)
       (pred_3 obj_18 obj_13)
       (pred_3 obj_18 obj_16)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_18 obj_10)
       (pred_3 obj_16 obj_15)
       (pred_3 obj_16 obj_11)
       (pred_3 obj_16 obj_18)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_12)
       (pred_3 obj_08 obj_14)
       (pred_3 obj_08 obj_13)
       (pred_3 obj_08 obj_10)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_13 obj_06)
       (pred_3 obj_13 obj_15)
       (pred_3 obj_13 obj_18)
       (pred_3 obj_13 obj_08)
       (pred_3 obj_15 obj_17)
       (pred_3 obj_15 obj_16)
       (pred_3 obj_15 obj_13)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_14 obj_06)
       (pred_3 obj_14 obj_08)
       (pred_3 obj_14 obj_02)
       (pred_3 obj_06 obj_17)
       (pred_3 obj_06 obj_13)
       (pred_3 obj_06 obj_14)
       (pred_3 obj_17 obj_15)
       (pred_3 obj_17 obj_06)
       (pred_5 obj_04)
       (pred_5 obj_10)
       (pred_8  obj_04 obj_01)
       (pred_8  obj_10 obj_09)
       (pred_10 obj_20)
       (pred_10 obj_05)
       (pred_10 obj_19)
       (pred_10 obj_11)
       (pred_10 obj_12)
       (pred_10 obj_18)
       (pred_10 obj_16)
       (pred_10 obj_08)
       (pred_10 obj_13)
       (pred_10 obj_15)
       (pred_10 obj_02)
       (pred_10 obj_14)
       (pred_10 obj_06)
       (pred_10 obj_17)

       (pred_11  obj_07 obj_01)
       (pred_11  obj_03 obj_09)
       (pred_9 obj_07 obj_02)
       (pred_9 obj_03 obj_15)
       (pred_12 obj_02)
    )

    (:goal (and
       (pred_9 obj_03 obj_16)
    ))
(:constraints
  (always (not (pred_12 obj_13)))
)
)

; plan
1. (op_3 obj_02 obj_14)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_14)
   goals met: 0 of 1
2. (op_3 obj_14 obj_06)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_06)
   goals met: 0 of 1
3. (op_3 obj_06 obj_17)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_17)
   goals met: 0 of 1
4. (op_3 obj_17 obj_15)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_15)
   goals met: 0 of 1
5. (op_4 obj_15 obj_03)
   deleted: (pred_9 obj_03 obj_15) (pred_7)
   added: (pred_2 obj_03)
   goals met: 0 of 1
6. (op_3 obj_15 obj_16)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_16)
   goals met: 0 of 1
7. (op_5 obj_16 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_7) (pred_9 obj_03 obj_16)
   goals met: 1 of 1
